c5/src/InformationRegisters/PayrollTaxes/PayrollTaxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PayrollTaxes</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Rate</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </resources>
  <resources>
    <name>Use</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Tax</name>
    <type>
      <types>ChartOfCalculationTypesRef.Taxes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Limit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/PayrollTaxes/Forms/Canceling/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	Record.Use = false;
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	Record.Tax = Parameters.Tax;
	Record.Limit = Parameters.Limit;
	Record.Rate = Parameters.Rate;
	
EndProcedure
